price/wealth-wp-product-utils-app-master/src/main/resources/healthCheck/amh/soap-adapter-request-template.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
    <env:Header/>
    <env:Body>
        <ns3:enquire xmlns:ns3="http://impl.service.proddetailbykeysenq.webservice.wpc.wmd.dummy.com/" xmlns="">
            <request>
                <channelCode>${channelCode}</channelCode>
                <countryCode>${countryRecordCode}</countryCode>
                <groupMemberCode>${groupMemberRecordCode}</groupMemberCode>
                <localeCode>zh_CN</localeCode>
                <productKey>
                    <productAlternativeNumber>${PROD_CDE}</productAlternativeNumber>
                    <productCodeAlternativeClassCode>P</productCodeAlternativeClassCode>
                    <productTypeCode>${PROD_TYPE_CDE}</productTypeCode>
                </productKey>
                <requestAttribute>
                    <attributeName>prodName</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodShrtName</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodPllName</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodSllName</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodShrtPllName</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodShrtSllName</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodMktPrcAmt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>ccyProdMktPrcCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prcEffDt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowBuyProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSellProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>asetText</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodShoreLocCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>riskLvlCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>topPerfmProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>topSellProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodSlstInd1</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodSlstInd2</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodMturDt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prdInvstTnorNum</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>ccyInvstCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>suptMipInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSwOutProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>asetVoltlClass_Cde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>asetVoltlClass_WghtPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>asetGeoLocAlloc_Cde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>asetGeoLocAlloc_WghtPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>asetSicAlloc_Cde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>asetSicAlloc_WghtPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>mrkToMktInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodTypCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodSubtpCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSwInProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowBuyUtProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSellAmtProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSellUtProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSellMipProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSellMipUtProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSwInAmtProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSwOutAmtProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSwOutUtProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>allowSwInUtProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodStatCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prdProdCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prdProdNum</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>mktInvstCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>divrNum</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>mngSolnInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>cntlAdvcInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>nonStdrdProdInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>asetVoltlClassMajrPrntCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>recomActCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>rcmndProdDescnCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodBidPrcAmt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodNavPrcAmt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodCnstrtInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>diversifiedInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>locOverAssCla</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>restrOnlScribInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>invstInitMinAmt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>invstMipIncrmMinAmt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>mktProdTrdCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>dscntSellPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prcEarlyRdmPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>coupnAnnlRt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>termRemainDayCnt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>coupnType</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>bondFltSprdRt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>coupnCurrStartDt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodIssDt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>intBassiCalcText</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>trdDt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>fixCashDivRt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>fixCashDivRtPa</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>undlStock_InstmUndlCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>undlStock_ProdInitSpotPriceAmt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>undlStock_CcyInstmUndlPrcCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>undlStock_ProdExerPrcAmt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>undlStock_ProdStrkCallPrcAmt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>undlStock_ProdKnockInPrcAmt</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>undl_prodTypCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>exerPrcPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>autoCallTrigPrcPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>knockInPrcPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>barrierPrcPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>potentCoupnPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>potentCoupnFrPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>potentCoupnToPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>exerPrcPctRgeFrom</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>exerPrcPctRgeTo</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>fixCoupnFrPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>fixCoupnToPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>SubDebtInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>highYieldBondInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodDervtCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>siFundInd</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>yieldAnnlPotenPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>eliPayoffTypeCde</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>eliIssuer</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>downOutBarrier</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>floorLvlPct</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>potentReturnText</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>prodFeatText</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>marketRate_currencyPair</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>marketRate_midRate</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>marketRate_xpeTime</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>finDocURL_PROSPECTUS</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>finDocURL_FACTSHEET</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>finDocURL_PRDHLTSHEET</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>finDocURL_ANULRPT</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>finDocURL_INTRMRPT</attributeName>
                </requestAttribute>
                <requestAttribute>
                    <attributeName>finDocURL_SFPSPCFINDOC</attributeName>
                </requestAttribute>
            </request>
        </ns3:enquire>
    </env:Body>
</env:Envelope>